# Pandas basics touch up

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

Object creation

In [3]:
s = pd.Series([1,2,3,np.nan,4,5,6])
print s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
6    6.0
dtype: float64

In [4]:
dates = pd.date_range('20130101',periods=6)
print dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20120101'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4, dtype='int32')
                    
                   })

print df2

     A          B    C  D
0  1.0 2012-01-01  1.0  3
1  1.0 2012-01-01  1.0  3
2  1.0 2012-01-01  1.0  3
3  1.0 2012-01-01  1.0  3

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
dtype: object

Viewing data

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print df

                   A         B         C         D
2013-01-01  0.057503  0.415615 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-03 -1.254495 -1.476824  0.103624 -0.229601
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-05  0.384851  0.651814  0.860110  0.416860
2013-01-06 -1.271997 -0.014185  0.084774  0.774339

In [11]:
df.head()

                   A         B         C         D
2013-01-01  0.057503  0.415615 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-03 -1.254495 -1.476824  0.103624 -0.229601
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-05  0.384851  0.651814  0.860110  0.416860

In [12]:
df.tail(4)

                   A         B         C         D
2013-01-03 -1.254495 -1.476824  0.103624 -0.229601
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-05  0.384851  0.651814  0.860110  0.416860
2013-01-06 -1.271997 -0.014185  0.084774  0.774339

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.values

array([[ 0.05750343,  0.41561493, -0.36614198,  2.69505328],
       [ 1.45407735, -0.31025868, -1.09042852, -1.02135603],
       [-1.25449476, -1.47682424,  0.10362382, -0.22960072],
       [ 1.73670802,  0.0142389 , -1.11900131, -0.01867335],
       [ 0.38485131,  0.65181394,  0.86011041,  0.41685952],
       [-1.27199701, -0.01418513,  0.08477449,  0.77433874]])

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.184441 -0.119933 -0.254511  0.436104
std    1.286043  0.746856  0.767375  1.264263
min   -1.271997 -1.476824 -1.119001 -1.021356
25%   -0.926495 -0.236240 -0.909357 -0.176869
50%    0.221177  0.000027 -0.140684  0.199093
75%    1.186771  0.315271  0.098911  0.684969
max    1.736708  0.651814  0.860110  2.695053

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.057503    1.454077   -1.254495    1.736708    0.384851   -1.271997
B    0.415615   -0.310259   -1.476824    0.014239    0.651814   -0.014185
C   -0.366142   -1.090429    0.103624   -1.119001    0.860110    0.084774
D    2.695053   -1.021356   -0.229601   -0.018673    0.416860    0.774339

In [18]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01  2.695053 -0.366142  0.415615  0.057503
2013-01-02 -1.021356 -1.090429 -0.310259  1.454077
2013-01-03 -0.229601  0.103624 -1.476824 -1.254495
2013-01-04 -0.018673 -1.119001  0.014239  1.736708
2013-01-05  0.416860  0.860110  0.651814  0.384851
2013-01-06  0.774339  0.084774 -0.014185 -1.271997

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -1.254495 -1.476824  0.103624 -0.229601
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-06 -1.271997 -0.014185  0.084774  0.774339
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-01  0.057503  0.415615 -0.366142  2.695053
2013-01-05  0.384851  0.651814  0.860110  0.416860

Selection

In [20]:
df['A']

2013-01-01    0.057503
2013-01-02    1.454077
2013-01-03   -1.254495
2013-01-04    1.736708
2013-01-05    0.384851
2013-01-06   -1.271997
Freq: D, Name: A, dtype: float64

In [21]:
df['2013-01-01':'2013-01-03']

                   A         B         C         D
2013-01-01  0.057503  0.415615 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-03 -1.254495 -1.476824  0.103624 -0.229601

Search by label

In [22]:
df.loc[dates[0]]

A    0.057503
B    0.415615
C   -0.366142
D    2.695053
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.057503  0.415615
2013-01-02  1.454077 -0.310259
2013-01-03 -1.254495 -1.476824
2013-01-04  1.736708  0.014239
2013-01-05  0.384851  0.651814
2013-01-06 -1.271997 -0.014185

In [24]:
df.loc['20130102',['A','B']]

A    1.454077
B   -0.310259
Name: 2013-01-02 00:00:00, dtype: float64

Selection by position

In [25]:
df.iloc[3]

A    1.736708
B    0.014239
C   -1.119001
D   -0.018673
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[1:3,2:3]

                   C
2013-01-02 -1.090429
2013-01-03  0.103624

Boolean indexing

In [27]:
df[df.A >0]

                   A         B         C         D
2013-01-01  0.057503  0.415615 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-05  0.384851  0.651814  0.860110  0.416860

In [28]:
df2 = df.copy()

In [29]:
df2['E'] = ['one', 'one','two','three','four','three']

In [30]:
df2

                   A         B         C         D      E
2013-01-01  0.057503  0.415615 -0.366142  2.695053    one
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356    one
2013-01-03 -1.254495 -1.476824  0.103624 -0.229601    two
2013-01-04  1.736708  0.014239 -1.119001 -0.018673  three
2013-01-05  0.384851  0.651814  0.860110  0.416860   four
2013-01-06 -1.271997 -0.014185  0.084774  0.774339  three

In [31]:
df2[df2['E'].isin(['two','three'])]

                   A         B         C         D      E
2013-01-03 -1.254495 -1.476824  0.103624 -0.229601    two
2013-01-04  1.736708  0.014239 -1.119001 -0.018673  three
2013-01-06 -1.271997 -0.014185  0.084774  0.774339  three

Setting

In [32]:
df.at[dates[0],'A']=0

In [33]:
df.iat[0,1]=0

Missing data

In [35]:
df.iloc[2:3]=np.nan
df.iloc[3:3]=np.nan

In [36]:
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-05  0.384851  0.651814  0.860110  0.416860
2013-01-06 -1.271997 -0.014185  0.084774  0.774339

In [37]:
df.dropna(how='any')

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-05  0.384851  0.651814  0.860110  0.416860
2013-01-06 -1.271997 -0.014185  0.084774  0.774339

In [41]:
df.fillna(value=4)

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.090429 -1.021356
2013-01-03  4.000000  4.000000  4.000000  4.000000
2013-01-04  1.736708  0.014239 -1.119001 -0.018673
2013-01-05  0.384851  0.651814  0.860110  0.416860
2013-01-06 -1.271997 -0.014185  0.084774  0.774339

In [43]:
pd.isnull(df)

                A      B      C      D
2013-01-01  False  False  False  False
2013-01-02  False  False  False  False
2013-01-03   True   True   True   True
2013-01-04  False  False  False  False
2013-01-05  False  False  False  False
2013-01-06  False  False  False  False

Operations

In [44]:
df.mean()

A    0.460728
B    0.068322
C   -0.326137
D    0.569244
dtype: float64

In [45]:
df.mean(1)

2013-01-01    0.582228
2013-01-02   -0.241991
2013-01-03         NaN
2013-01-04    0.153318
2013-01-05    0.578409
2013-01-06   -0.106767
Freq: D, dtype: float64

In [46]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.366142  2.695053
2013-01-02  1.454077 -0.310259 -1.456571  1.673697
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  3.190785 -0.296020 -2.575572  1.655024
2013-01-05  3.575637  0.355794 -1.715461  2.071883
2013-01-06  2.303640  0.341609 -1.630687  2.846222

In [47]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [48]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [49]:
df = pd.DataFrame(np.random.randn(10,4))

In [52]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [53]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [56]:
df["grade"] = df['raw_grade'].astype('category')
df['grade'].cat.categories = ['V good','good','bad']

In [57]:
df

   id raw_grade   grade
0   1         a  V good
1   2         b    good
2   3         b    good
3   4         a  V good
4   5         a  V good
5   6         e     bad

In [58]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [62]:
ts  = ts.cumsum()
plot = ts.plot()